SET NAMES UTF8;
DROP DATABASE IF EXISTS yummy;
CREATE DATABASE yummy CHARSET=UTF8;
USE yummy;

CREATE TABLE yummy_products (
    pid INT PRIMARY KEY AUTO_INCREMENT,
    pimg VARCHAR(64),
    ptitle VARCHAR(64),
    pname VARCHAR(64),
    sugar INT,
    price INT,
    sort INT,
    psmell VARCHAR(16),
    psort VARCHAR(16),
    pmaterial VARCHAR(64)
);
INSERT INTO yummy_products VALUES
(NULL,'images/xin1.jpg','STARRY SKY星空','乳脂奶油水果慕斯蛋糕',1,160,01,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/xin2.jpg','CHRISTMAS TOWN 圣诞小镇','最美的时光奶油巧克力蛋糕',2,145,01,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/xin3.jpg','COEUR 花心','520情人节蛋糕巧克力花心甜品',1,140,01,'乳脂蛋糕','巧克力奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/xin4.jpg','KISS OF NEW YEAR 新年之吻','新年聚会生日翻糖蛋糕',1,159,01,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/xin5.jpg','KISS OF NEW YEAR 新年之吻','元旦之恋生日奶油拉丝蛋糕',2,160,01,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/xin6.jpg','CHRISTMAS TOWN 圣诞小镇','最美的时光奶油巧克力蛋糕',1,163,01,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/xin7.jpg','KISS OF NEW YEAR 新年之吻','元旦之恋生日奶油拉丝蛋糕',2,149,01,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/xin8.jpg','KISS OF NEW YEAR 新年之吻','元旦之恋生日奶油拉丝蛋糕',1,137,01,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/ka1.jpg','Baymax 大白可爱萌礼物',' 戚风乳脂奶油蛋糕 生日蛋糕',1,170,02,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/ka2.jpg','哆啦A梦',' 温情感动奶油戚风蛋糕',2,160,02,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/ka3.jpg','Captain America',' 美国队长卡通奶油戚风生日蛋糕',1,152,02,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/ka4.jpg','BATMAN 蝙蝠侠',' 儿童卡通天津蛋糕生日蛋糕',1,150,02,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/ka5.jpg','SUPERHERO 超人',' 儿童卡通天津蛋糕生日蛋糕',1,130,02,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/ka6.jpg','Mr.Q 大眼仔',' 乳脂卡通儿童生日蛋糕',1,150,02,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/ka7.jpg','Ironman新能量钢铁侠',' 乳脂卡通儿童生日蛋糕',2,150,02,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/cai1.jpg','彩虹',' 乳脂奶油戚风彩虹生日蛋糕',1,160,03,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/cai2.jpg','SUMMERLOVE 恋夏',' 乳脂奶油戚风彩虹生日蛋糕',1,148,03,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/cai3.jpg','SNOWFALL 降雪',' 草莓戚风鲜奶生日彩虹蛋糕',2,150,03,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/cai4.jpg','SURPRISE惊喜',' 彩虹蛋糕奶油生日蛋糕',1,150,03,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/chun1.jpg','SUCCULENT 多肉',' 春暖花开生日蛋糕',1,150,04,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/chun2.jpg','SUCCULENT 多肉',' 春暖花开生日蛋糕',1,150,04,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/chun3.jpg','SUCCULENT 多肉',' 春暖花开生日蛋糕',1,150,04,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/chun4.jpg','SUCCULENT 多肉',' 春暖花开生日蛋糕',1,150,04,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/pao1.jpg','闪电泡芙','  香草杏仁',1,45,06,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/pao4.jpg','闪电泡芙','   抹茶与开心果浆的碰撞',1,45,06,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/pao3.jpg','闪电泡芙','   榴莲与牛奶的双重爽滑',1,45,06,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/bei1.jpg','迷你杯子','  香草杏仁',1,35,05,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/bei2.jpg','迷你杯子','  香浓巧克力',1,35,05,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/bei3.jpg','迷你杯子','  香草杏仁',1,35,05,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/bei4.jpg','迷你杯子','  草莓果酱',1,35,05,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠'),
(NULL,'images/bei5.jpg','迷你杯子','  抹茶',1,35,05,'乳脂蛋糕','香草奶油','奶油(新西兰）、砂糖(韩国)、芒果（澳洲及台湾）、巧克力脆豆（比利时）、棉花糖、黄油曲奇、英国糖珠');

CREATE TABLE yummy_userinfo (
    uname VARCHAR(32),
    upwd VARCHAR(32),
    birthday DATE,
    location VARCHAR(64)
);
INSERT INTO yummy_userinfo VALUES(
    'qiangdong','123456','2016-10-02','sdfdsdf'
);
